Repository: siwells/advanced-webtech
Catalog: case.study/daybook/translations/*/LC_MESSAGES/messages.po
Languages: fi

source: An account already exists for that email address. Please either use another email address or use the recover password feature.
fi: Antamallasi sähköpostiosoitteella on jo luotu käyttäjätili. Anna toinen sähköpostiosoite tai käytä salasanan palautustoimintoa.

source: SUPERHUB Project :: New Journey Diary Account
fi: SUPERHUB -Projekti :: Uusi Matkapäiväkirjatili

source: A new SUPERHUB Journey Diary account has been created for the following email address: {kwarg}. You should now be able to log into the journey diary and record your journeys.
fi: Uusi SUPERHUB -matkapäiväkirjatili on luotu sähköpostiosoitteelle:{kwarg}. Voit nyt kirjautua matkapäiväkirjatilille ja kirjata sinne matkatietosi

source: An email has been sent to {kwarg} so that you can verify your email address. However you can log into your account immediately.
fi: Sähköpostiosoitteeseen {kwarg} on lähetetty viesti sähköpostiosoitteesi varmistamiseksi. Voit kuitenkin jo kirjautua sisään.

source: The supplied passwords do not match. Please ensure that you type the same password into both the password box and the confirmation box.
fi: Annettu salasana on väärä. Varmista, että kirjoitat saman salasanan sekä salasana- että salasanan vahvistuskenttään.

source: The supplied password was incorrect
fi: Annettu salasana on väärä

source: This site uses cookies. By continuing to browse the site you are agreeing to our use of cookies.
fi: Tämä sivusto käyttää evästeitä. Jatkamalla sivuston käyttöä, hyväksyt evästeiden käytön.

source: Your journey entry was added to your diary
fi: Matkatieto on lisätty matkapäiväkirjaasi

source: SUPERHUB Project :: New Password
fi: SUPERHUB -projekti :: Uusi Salasana

source: The password for the following email address: {email} was reset. You should now be able to log into the journey diary and record your journeys using the password: {newpass}.
fi: Tälle sähköpostitilille:{ email} luotu salasana on poistettu käytöstä. Voit nyt kirjautua sisään ja lisätä matkatietosi käyttämällä uutta salasanaa: {newpass}.

source: An email was sent to {arg}
fi: Sähköpostiviesti on lähetetty {arg}

source: We were not able to update the password for this account. Please contact super.hub.eu@gmail.com
fi: Emme pystyneet päivittämään tämän tilin salasanaa. Ole hyvä ja ota meihin yhteyttä lähettämällä sähköpostia osoitteeseen: super.hub.eu.@gmail.com

source: There is no SUPERHUB account associated with the email address:
fi: Tähän sähköpostiosoitteeseen liittyvää SUPERHUB -tiliä ei ole olemassa.

source: Your password has been updated
fi: Salasanasi on päivitetty

source: Something went wrong when setting your new password. Please try again
fi: Jokin meni vikaan salasanasi vaihdossa. Yritä uudelleen

source: Please ensure that your new passwords match
fi: Varmista, että uudet salasanasi täsmäävät

source: Please enter you current password correctly
fi: Syötä nykyinen salasanasi oikein

source: Your default language settings have been updated
fi: Kielivalintasi automaattiset asetukset on päivitetty

source: Return to Your Journey Diary
fi: Palaa matkapäiväkirjaasi

source: SUPERHUB Journey Diary
fi: SUPERHUB -matkapäiväkirja

source: View Diary Entries
fi: Tarkastele päiväkirjamerkintöjä

source: Add New Diary Entry
fi: Lisää uusi päiväkirjamerkintä

source: Settings
fi: Asetukset

source: Sign out
fi: Kirjaudu ulos

source: Go to the SUPERHUB Journey Diary homepage
fi: Siirry SUPERHUB -matkapäiväkirjan kotisivulle

source: Forgotten Password?
fi: Unohtuiko salasana?

source: Your Journey Diary Dashboard
fi: Matkapäiväkirjasi leikepöytä

source: Your Journey Diary
fi: Matkapäiväkirjasi

source: Dashboard
fi: Leikepöytä

source: You have made the following journey diary entries
fi: Olet tehnyt seuraavat matkapäiväkirjamerkinnät

source: You have not entered any journey diary entries
fi: Et ole tehnyt matkapäiväkirjamerkintöjä

source: Review existing entries
fi: Tarkastele tekemiäsi merkintöjä

source: Select a journey
fi: Valitse matka

source: Date
fi: Päivämäärä

source: Time
fi: Aika

source: Origin
fi: Lähtöpaikka

source: Destination
fi: Määränpää

source: Duration
fi: Kesto

source: Overall Journey Rating
fi: Matkan yleisarvosana

source: Journey Legs
fi: Etapit

source: Select a Leg
fi: Valitse etappi

source: Travel Mode for this leg
fi: Matkustustapa tälle etapille

source: Rating for this leg
fi: Arvosana tälle etapille

source: Notes
fi: Muistiinpanot

source: Leg
fi: Etappi

source: Travel mode for this leg
fi: Matkustustapa tälle etapille

source: Bicycle
fi: Polkupyörä

source: Bicycle Share
fi: Pyörien yhteiskäyttöpalvelu, esim. citybike

source: Bus
fi: Bussi

source: Car
fi: Henkilöauto

source: Car Share
fi: autojen yhteiskäyttöpalvelu, esim. citycarclub

source: Ferry
fi: Lautta

source: Moped
fi: Mopo

source: Motorbike
fi: Moottoripyörä

source: Taxi
fi: Taksi

source: Taxi Share
fi: Jaettu taksi

source: Train
fi: Juna

source: Tram
fi: Raitiovaunu

source: Trolleybus
fi: Johdinauto, sähkökäyttöinen linja-auto

source: Walk
fi: Kävely

source: Other
fi: Muu

source: Duration of journey
fi: Matkan kesto

source: Hour
fi: Tunnit

source: Minute
fi: Minuutit

source: Add a new entry
fi: Lisää uusi merkintä

source: Overview of your journey
fi: Matkan yleisnäkymä

source: Please enter the address where your journey started. Include as much detail as possible.
fi: Lisää matkan lähtöosoite niin yksityiskohtaisesti kuin mahdollista.

source: where your journey started
fi: Mistä matka alkoi

source: Please enter the address where your journey finished. Include as much detail as possible.
fi: Lisää matkan pääteosoite niin yksityiskohtaisesti kuin mahdollista.

source: where your journey ended
fi: Minne matka päättyi

source: Day
fi: Päivä

source: January
fi: Tammikuu

source: February
fi: Helmikuu

source: March
fi: Maaliskuu

source: April
fi: Huhtikuu

source: May
fi: Toukokuu

source: June
fi: Kesäkuu

source: July
fi: Heinäkuu

source: August
fi: Elokuu

source: September
fi: Syyskuu

source: October
fi: Lokakuu

source: November
fi: Marraskuu

source: December
fi: Joulukuu

source: Month
fi: Kuukausi

source: Year
fi: vuosi

source: Departure time
fi: Lähtöaika

source: Rate your journey overall
fi: Matkan yleisarvosana

source: Please select a rating for this journey overall. On this scale 1 is a low quality rating and 5 is a high quality rating.
fi: Valitse matkalle yleisarvosana. Asteikko on 1-5, jossa 1 on huonoin arvosana ja 5 on paras arvosana.

source: Add a journey leg
fi: Lisää etappi

source: Leg 1
fi: Etappi 1

source: Notes about your journey
fi: Matkaa koskevat muistiinpanot

source: Add this entry to your journey diary
fi: Lisää tämä merkintä matkapäiväkirjaasi

source: Index
fi: Hakemisto

source: SuperHub is an open platform for integrated, multi-modal, urban mobility that aims to support YOU in selecting and using ecologically sustainable transport options.
fi: SUPERHUB on avoin alusta integroidulle, monikanavaiselle ja urbaanille liikkuvuudelle, jonka tarkoituksena on tukea SINUN valintojasi ja ekologisten matkustustapojen käyttöä.

source: Join
fi: Liity

source: First Name
fi: Etunimi

source: Last Name
fi: Sukunimi

source: Email
fi: Sähköpostiosoite

source: Email Address
fi: Sähköpostiosoite

source: Password
fi: Salasana

source: Password Confirmation
fi: Salasanan vahvistus

source: Confirm Password
fi: Vahvista salasana

source: Login
fi: Sisäänkirjautuminen

source: Sign In
fi: Kirjaudu sisään

source: Verification
fi: Vahvistaminen

source: Recover Lost Password
fi: Hae unohtunut salasana

source: If you have lost your password, please type in your email address and press the "Recover Password" button. An email will be sent to your registered account with further instructions.
fi: Jos olet unohtanut salasanasi, anna sähköpostiosoitteesi ja paina "HAE SALASANA" painiketta. Tiliisi liitettyyn sähköpostiosoitteeseen lähetetään viesti, joka sisältää ohjeet salasanan palauttamiseen.

source: Recover Password
fi: Hae salasana

source: Your Journey Diary Account Settings
fi: Matkäpäiväkirjatilin asetukset

source: Account Settings
fi: Tiliasetukset

source: Change Your Password
fi: Vaihda salasana

source: Existing Password
fi: Nykyinen salasana

source: New Password
fi: Uusi salasana

source: Repeat Password
fi: Toista salasana

source: your new password again
fi: Salasanasi uudelleen

source: Update Password
fi: Päivitä salasana

source: Set your default language
fi: Valitse käyttämäsi kieli

source: Select a language
fi: Valitse kieli

source: Catalan
fi: Katalaani

source: English
fi: Englanti

source: Italian
fi: italia

source: Finnish
fi: Suomi

source: Spanish
fi: Espanja

source: Update Language
fi: Päivitä kieliasetus
